read_verilog  ../../src/axi/pre_processor_a.sv
read_verilog  ../../src/axi/pre_processor_b.sv
read_verilog  ../../src/axi/multiplier.sv
read_verilog  ../../src/axi/processing_element.sv
read_verilog  ../../src/axi/group_processing_element.sv
read_verilog  ../../src/axi/group_processing_element_15.sv
read_verilog  ../../src/axi/processing_element_64.sv
read_verilog  ../../src/axi/group_processing_element_16.sv
read_verilog  ../../src/axi/group_processing_element_31.sv
read_verilog  ../../src/axi/processing_element_128.sv
read_verilog  ../../src/axi/group_processing_element_32.sv
read_verilog  ../../src/axi/group_processing_element_47.sv
read_verilog  ../../src/axi/processing_element_256.sv
read_verilog  ../../src/axi/group_processing_element_64.sv
read_verilog  ../../src/axi/group_processing_element_79.sv
read_verilog  ../../src/axi/processing_element_512.sv
read_verilog  ../../src/axi/group_processing_element_128.sv
read_verilog  ../../src/axi/group_processing_element_143.sv
read_verilog  ../../src/axi/processing_element_960.sv
read_verilog  ../../src/axi/group_processing_element_240.sv
read_verilog  ../../src/axi/group_processing_element_255.sv
read_verilog  ../../src/axi/systolic_tensor_array.sv
read_verilog  ../../src/axi/post_processor.sv
read_verilog  ../../src/axi/dimension_aligned_ws_sta_16x16x1x4x1.sv

read_verilog  ../../src/axi/axi_top_16x16.v

opt -full

memory -nomap

hierarchy -check -top axi_top_16x16

show -format dot -prefix axi_top_16x16
