read_verilog  ../../src/basic/multiplier.sv
read_verilog  ../../src/basic/processing_element.sv
read_verilog  ../../src/basic/processing_element_64.sv
read_verilog  ../../src/basic/processing_element_128.sv
read_verilog  ../../src/basic/processing_element_256.sv
read_verilog  ../../src/basic/processing_element_512.sv
read_verilog  ../../src/basic/processing_element_960.sv
read_verilog  ../../src/basic/group_processing_element.sv
read_verilog  ../../src/basic/group_processing_element_15.sv
read_verilog  ../../src/basic/group_processing_element_16.sv
read_verilog  ../../src/basic/group_processing_element_31.sv
read_verilog  ../../src/basic/group_processing_element_32.sv
read_verilog  ../../src/basic/group_processing_element_47.sv
read_verilog  ../../src/basic/group_processing_element_64.sv
read_verilog  ../../src/basic/group_processing_element_79.sv
read_verilog  ../../src/basic/group_processing_element_128.sv
read_verilog  ../../src/basic/group_processing_element_143.sv
read_verilog  ../../src/basic/group_processing_element_240.sv
read_verilog  ../../src/basic/group_processing_element_255.sv
read_verilog  ../../src/basic/systolic_tensor_array.sv

hierarchy -check -top systolic_tensor_array

proc; opt; fsm; opt; memory; opt
show -format dot -prefix systolic_tensor_array
